export default [
  {
    title: 'Проект',
    description: 'Согласование проекта, утверждение договора и стоимости строительства',
    img: 'project',
    ourCompany: [
      'Предложим на выбор несколько готовых вариантов',
      'Бесплатно внесем любые изменения в проект',
      'В случае необходимости сделаем расчет в тот же день',
    ],

    others: ['Долгое согласование проекта', 'Непродуманная планировка типовых вариантов', 'Отсутствие готовых примеров работ'],
  },

  {
    title: 'Материал',
    description: 'Подготовка материала на нашем собственном производстве',
    img: 'material',
    ourCompany: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],

    others: [
      'Долгая комплектация за счет закупки материалов у посредника',
      'Закупка материалов низкого качества ',
      'Отсутствие гарантии на материал',
    ],
  },

  {
    title: 'Доставка',
    description: 'Доставка всего необходимого материала до вашего участка',
    img: 'delivery',
    ourCompany: [
      'Доситавим материал бесплатно от 500км от производства',
      'Доставим в удобное для вас время',
      'Имеем собственный парк автотранспорта',
    ],

    others: ['Платная доставка', 'Неналаженная логистика', 'Технические проблемы с транспортом'],
  },

  {
    title: 'Выгрузка',
    description: 'Бесплатная выгрузка материала в рамках 30 м. от места строительства',
    img: 'discharge',
    ourCompany: ['Выгрузим бесплатно', 'Бережное складирование на участке и защита от осадков', 'Гарантируем сохранность материала по договору'],

    others: [
      'Вымогательство бригад за выгрузку',
      'Материал складируется как попало, под открытым небом',
      'Отсутствие ответственности за сохранность',
    ],
  },

  {
    title: 'Договор',
    description: 'Подписание ранее согласованного договора по факту выгрузки материала',
    img: 'contract',
    ourCompany: [
      'Юридически обязывающий официальный договор',
      'Учет всех нюансов и регламентация отношений',
      'Предоставление официальной гарантии на работы',
    ],

    others: ['Работы без договора', 'Заключение договора с фирмой-однодневкой', 'Отстутствие гарантии и ответственности перед Вами'],
  },

  {
    title: 'Аванс',
    description: 'Оплата 70% суммы по договору только по факту выгрузки материала и начала работ',
    img: 'prepaid',
    ourCompany: [
      'Не требуем предоплаты до того, как выгрузим весь материал и приступим к строительству',
      'Не требуем полной оплаты до завершения всех работ, 70% - это средняя стоимость материалов',
      'Предоставим официальную квитанцию в рамках приложения к договору',
    ],

    others: [
      'Требуют предоплату до доставки материала',
      'Непрозрачное ценообразование и механизма оплаты',
      'Постоянное возникновение дополнительных расходов во время строительных работ',
    ],
  },

  {
    title: 'Работа',
    description: 'Произведем монтаж фундамента и предварительные работы',
    img: 'work',
    ourCompany: ['Гарантия на фундамент', 'Работа точно в срок, указанный в договоре', 'Гарантируем опыт и отвественность рабочих бригад'],

    others: ['Несоблюдения сроков', 'Привлечение низкоквалифицированной рабочей сили', 'Несоблюдение технологического процесса'],
  },

  {
    title: 'Сруб',
    description:
      'Производство работ по монтажу основания, несущей конструкции, внутренних перегородок, межэтажных перекрытий, фронтонной части, стропильной системы, кровли',
    img: 'log',
    ourCompany: [
      'Двойное основание из нестроганного бруса',
      'Рубка в “теплый угол” бесплатно',
      'Монтируем ройки в дверные и оконные проемы бесплатно',
    ],

    others: ['Основание из одного венца', 'Рубка в “стык”, за “теплый угол” придется доплатить', 'Ройки устанавливаются за отдельную плату'],
  },

  {
    title: 'Отделка',
    description: 'Производство комплекса отделочных работ',
    img: 'decoration',
    ourCompany: [
      'Пароизоляция во все внешние контуры пола, потолка, кровли, фронтов',
      'Сухая вагонка для помещения мансарды, сухой плинтус, деревянная лестница с резными балясами',
      'Имеем собственный парк автотранспорта',
    ],

    others: ['Некачественный и влажные отделочные материалы', 'Наличие щелей и дургих дефектов отделки', 'Отсутствие герметичности конструкции'],
  },

  {
    title: 'Сдача',
    description: 'Сдача объекта, устранение возможных недочетов, подписание заказчиком акта приемки, оплата оставшихся 30% стоимости работ',
    img: 'finish',
    ourCompany: [
      'Доведем работу до конца, пока заказчика полностью не удовлетворят результаты работ',
      'Обеспечим чистоту и порядок на месте проведения работ',
      'Устраним скрытые дефекты, обнаруженные уже после сдачи объекта',
    ],

    others: [
      'Споры и конфликтные ситуации по завершении работ',
      'Отсутствие нормированного механизма сдачи объекта',
      'Отказ от гарантийных обязательств',
    ],
  },
];
