export default [
  {
    title: 'Бесплатная доставка',
    description: 'В радиусе 500 км от места нашего производства (г. Устюжна) доставка осуществляется бесплатно',
    path: 'free-delivery',
    button: 'Подробнее',
    buttonPath: '/Delivery',
  },

  {
    title: 'Красочный каркасный дом в подарок до 31 марта',
    description: 'Покраска дерева осуществляется на собственном производстве перед отправкой на объект. Любой цвет на выбор',
    path: 'colorful',
  },

  {
    title: 'Дверь Бесплатно',
    description: 'Входная металлическая дверь в подарок для любого заказа "под ключ"',
    path: 'free-door',
  },

  {
    title: 'Теплый угол Бесплатно',
    description: 'Сборка угловых соединений "шип-паз"',
    path: 'warn-corner',
  },

  {
    title: 'Усиленные чистовый полы 36мм - в подарок',
    description: '*Вместо 27мм в стандартной комплектации',
    path: 'floors',
  },

  {
    title: 'Ройки в проемы в подарок',
    description: 'Монтируем обсадные бруски в проёмы',
    path: 'openings',
  },
];
