export const state = () => ({
  houses: [
    {
      name: 'doma-iz-brusa',
      title: 'Дома из бруса',
      meta: {
        title: 'Строительство домов из бруса | Компания «Брусичъ»',
        content: 'Наша компания занимается строительством домов из бруса в Москве, Подмосковье и на всей территории европейской части РФ. Реализуем любые проекты. Качество, экологичность, оперативность и доступность цен гарантируем.',
        keywords: 'строительство домов из бруса, строительство домов из бруса под ключ, строительство домов из бруса Москва Московская область, цена строительства дома из бруса, заказать строительство дома из бруса'
      },
      features: {
        title: 'Преимущества заказа строительства домов из бруса в нашей компании',
        content: [
          {
            title: 'Высокая скорость строительства.',
            inner: 'Монтаж осуществляется в сжатые сроки — от возведения свайного фундамента до декоративной отделки потребуется от 4 до 12 недель.'
          },
          {
            title: 'Хорошая теплоизоляция.',
            inner: 'В комплектации «под ключ» можно выбрать брус для наружных стен сечением 100x150, 150x150 или 200x150 мм.'
          },
          {
            title: 'Экологичность.',
            inner: 'В отличие от клееного бруса, профилированный брус является натуральным материалом, который не выделяет токсичных вредных соединений.'
          },
          {
            title: 'Большой выбор архитектурно-планировочных решений.',
            inner: 'Принимаем заказы на строительство домов в один, полтора или два этажа, с мансардой, эркером, вторым светом, террасой, верандой.'
          },
          {
            title: 'Доступная стоимость.',
            inner: 'Строительство брусового коттеджа или деревянного дачного дома обойдется намного дешевле кирпичной постройки такой же площади и планировки.'
          }
        ]
      },
      previewIMG: 'https://i.imgur.com/f2j5Cnj.png',
      houses: null
    },
    {
      name: 'doma-pod-usadku',
      title: 'Дома под усадку',
      meta: {
        title: 'Строительство домов под усадку | Компания «Брусичъ»\n',
        content: 'В нашей компании можно заказать строительство дома из бруса под усадку в Москве, Подмосковье и на всей территории европейской части РФ. Используем исключительно брус из зимнего леса. Высокое качество гарантируем. ',
        keywords: 'дом под усадку, дома из бруса под усадку, строительство домов под усадку, строительство домов из бруса под усадку.'
      },
      previewIMG: 'https://i.imgur.com/CSlXnAZ.png',
      features: {
        title: 'Особенности строительства домов под усадку',
        content: [
          {
            title: 'Два этапа.',
            inner: 'В отличие от строений «под ключ» дома под усадку возводятся в два этапа. Вначале выполняются все капитальные работы, включающие обустройство фундамента, возведение стен монтаж перекрытий, создание стропильной системы, установка кровли. На время усадки влияют многие факторы, такие как сезонность проведения строительных работ, особенности климата местности, размеры строения, влажность бруса. После полной усадки строения, наши специалисты проводят монтаж чистового пола, прокладку инженерных коммуникаций в доме, установку оконных и дверных блоков, отделку.'
          },
          {
            title: '«Зимний лес».',
            inner: 'Наша компания сама занимается лесозаготовками и подготовкой пиломатериалов. При этом для строительства домов из бруса под усадку мы используем исключительно зимний лес. Дом из такой древесины естественной влажности осаживается равномерно, плавно, без возникновения каких-либо негативных последствий. Мы гарантируем высокое качество и экологичность используемых для строительства домов под усадку материалов.'
          },
          {
            title: 'Технологии уменьшения последствий осаживания дома.',
            inner: 'В каждом конкретном случае в зависимости от особенностей местности, где происходит строительство дома из бруса под усадку, а также специфики самого строения наши специалисты используют различные технологии, которые способствуют снижению до минимума негативных последствий усадки. Среди технологий, применяемых нами, принудительная осадка стен, использование высококачественного межвенцового утеплителя, устройство обсады, применение компенсаторов усадки.'
          }
        ]
      },
      houses: null
    },
    {
      name: 'karkasnie-doma',
      title: 'Каркасные дома',
      meta: {
        title: 'Каркасные дома в Москве, Московской области и по всей территории европейской части РФ',
        content: 'Компания «Брусичъ» занимается строительством каркасных домов под ключ. Реализуем любые проекты, строим в любое время года, гарантируем высокое качество строительства.',
        keywords: 'каркасные дома под ключ, строительство каркасных домов Москва, каркасные дома в Москве и Московской области'
      },
      previewIMG: 'https://i.imgur.com/Bv2l0wO.png',
      features: {
        title: 'Преимущества каркасных домов',
        content: [
          {
            title: 'Прочность и отсутствие усадки.',
            inner: 'Изготавливаемые нами несущие каркасы имеют высокие показатели прочности. Мы используем брус камерной сушки, заготовленный собственными силами. Его влажность не превышает 14%. Наши конструкции достаточно лёгкие, не требуют создания сложных фундаментов, не дают усадку, что позволяет возводить каркасные дома под ключ.'
          },
          {
            title: 'Возможность строить в любое время года.',
            inner: 'При строительстве каркасных домов не используются «мокрые» процессы, такие как склеивание, оштукатуривание, применение специальных строительных смесей, что позволяет строить в любое время года.'
          },
          {
            title: 'Утепление.',
            inner: 'Особое внимание мы уделяем утеплению каркасных домов. Наши специалисты собирают каркасы без зазоров и используют теплоизоляционный материал большой толщины. Это позволяет исключить теплопотери, не допустить появление конденсата и плесени. Возводимые нами каркасные дома тёплые и комфортные.'
          },
          {
            title: 'Вентиляция.',
            inner: 'В каркасных домах, возводимых силами нашей компанией, в обязательном порядке обустраивается система вентиляции во всех помещениях. Мы предусматриваем вентиляцию, как через наружные стены, так и посредством вентиляционных каналов, выходящих на кровлю.'
          },
          {
            title: 'Доступные цены.',
            inner: 'Мы сами занимаемся лесозаготовками и подготовкой пиломатериалов. Строительные работы выполняются исключительно штатными специалистами нашей компании, без привлечения бригад со стороны. Всё это в совокупности позволяет нам устанавливать доступные цены на каркасные дома, которые на 15-20% ниже среднерыночных.'
          }
        ]
      },
      houses: null
    },
    {
      name: 'bani-iz-brusa',
      title: 'Бани из бруса',
      meta: {
        title: 'Строительство бань из бруса в Москве, Московской области и по всей территории европейской части РФ',
        content: 'В компании «Брусичъ» можно заказать строительство бани из бруса под ключ. Мы сами занимаемся лесозаготовкой, используем только высококачественную древесину, строим быстро и качественно.',
        keywords: 'баня из бруса, баня из бруса под ключ, строительство бани из бруса, строительство бань из бруса в Москве'
      },
      previewIMG: 'https://i.imgur.com/vqGj1vy.png',
      features: {
        title: 'Преимущества строительства бань из бруса силами нашей компании',
        content: [
          {
            title: 'Русский стиль.',
            inner: 'Наши строители и дизайнеры умеют удачно совмещать старинные банные традиции с современными технологиями. В итоге получаются добротные помещения и уникальные интерьеры, которые пользуются особым спросом у застройщиков. И независимо от выбранного проекта бани строения отличаются неповторимой стилистикой деревянного зодчества. Отличным вариантом является комплексное строительство на загородном участке дома из бруса и бани, выполненных в едином стиле.'
          },
          {
            title: 'Строительство бань из бруса под ключ.',
            inner: 'Мы обеспечиваем комплексный подход к строительству бань из бруса, начиная с заготовки пиломатериалов и комплектации и заканчивая отделочными работами и сдачей готового объекта в эксплуатацию. Все работы проводятся штатными специалистами компании, имеющими достаточный опыт.'
          },
          {
            title: 'Большой выбор проектов.',
            inner: 'Наши возможности позволяют реализовывать абсолютно любые проекты, начиная от небольших бюджетных брусовых бань до двухэтажных банных комплексов с просторными комнатами отдыха, парилками, купелями, бассейнами, спальнями, террасами. При этом проекты могут быть как типовыми, так и индивидуальными.'
          },
          {
            title: 'Высокие темпы, доступные цены.',
            inner: 'Сама по себе технология строительства бань из бруса под ключ предполагает обустройство небольшого фундамента, неиспользование тяжёлой техники и практически отсутствие усадки. Всё это позитивно сказывается на оперативности проведения работ, стоимости строительства и позволяет нам давать в этом твёрдые гарантии.\n'
          },
          {
            title: 'Широкий географический охват.',
            inner: 'Мы принимаем заказы на строительство бань из бруса в Москве, Московской области и абсолютно по всей территории европейской части Российской Федерации.'
          }
        ]
      },
      houses: null
    },
    {
      name: 'barnhausy',
      title: 'Барнхаусы',
      meta: {
        title: 'Строительство барнхаусов | Компания «Брусичъ»',
        content: 'В нашей компании можно заказать строительство дома-барнхауса в Москве, Московской области и на всей территории европейской части России. Реализуем проекты любой сложности, используем экологически чистые стройматериалы, строим быстро, качественно и по доступным ценам.',
        keywords: 'барнхаус дома, строительство барнхаус'
      },
      previewIMG: 'https://i.imgur.com/2vdbAmx.png',
      features: {
        title: 'Особенности барнхаусов, возводимых нашей компанией',
        content: [
          {
            title: 'Широкий выбор конструктивных решений.',
            inner: 'Несмотря на буквально взрывное развитие направления barn в загородном строительстве и появление ультрасовременных проектов домов, нашим специалистам удаётся сочетать в возводимых домах-барнхаусах уникальный ретро-стиль. Их отличает простота и естественность архитектурных решений, в которых создана комфортная для жизни гармоничная среда. Городских жителей привлекает в таких домах деревенский стиль, лаконичность форм, естественные цветовые оттенки, натуральная отделка, панорамное освещение, наличие террасы.'
          },
          {
            title: 'Безупречное качество и экологичность.',
            inner: 'Мы сами занимаемся лесозаготовками и подготовкой материалов для строительства, поэтому гарантируем их высокое качество и экологичность. С клееным брусом, в структуре которого плотные слои клеевого состава, не работаем. Строительные работы проводятся исключительно штатными специалистами компании, имеющими достаточный опыт. Мастеров и бригад со стороны не привлекаем. Всё это позитивно сказывается на качестве строительства.'
          },
          {
            title: 'Высокие темпы.',
            inner: ' В своей работе мы применяем быстровозводимые технологии, что позволяет поддерживать высокие темпы строительства. Обычно на возведение стандартного одноэтажного дома-барнхауса уходит от двух до четырёх месяцев.\n'
          },
          {
            title: 'Широкая география и доступная цена. ',
            inner: 'Мы сами занимаемся комплектацией строительства барнхаусов. Пиломатериалы свои, другие стройматериалы и оборудование мы получаем от производителей или их официально аккредитованных в Российской Федерации представителями. Всё это позволяет нам устанавливать цены на строительство барнхаусов на 15-20% ниже среднерыночных по региону. У нас можно заказать барнхаус как в Москве и Подмосковье, так и на всей территории европейской части России.'
          }
        ]
      },
      houses: null
    },
  ], // Дома
  apiURL: 'https://strapi.preprod.brusich.ru/api' // URL к API
})
export const mutations = {
  setHouses(state, { data, category }) {
    const to = state.houses.find(e => e.name === category)
    to.houses = data
  },
}
