<template>
  <div class="faq global-wrapper">
    <h2 class="faq-header__item">Вопрос ответ</h2>
    <questionAndAnswer
      style="margin-bottom: 35px; max-width: 100%; overflow: hidden"
      :work="faq.nav"
    />
    <div class="faq-container">
      <div
        class="faq-item"
        v-for="(item, i) in faq.nav"
        :key="i"
        :id="sendId(item.title)"
      >
        <h2 class="faq-item-header__item">{{ item.title }}</h2>

        <div class="faq-item-wrapper">
          <div
            class="faq-item-ask"
            v-for="(ask, j) in item.data"
            :key="j"
            :class="{ 'faq-item-ask-active': ask.status }"
            @click="ask.status = !ask.status"
          >
            <span>
              <h4>{{ ask.ask }}</h4>
              <svg
                v-if="!ask.status"
                width="11"
                height="6"
                viewBox="0 0 11 6"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M0.291504 0.416626L5.49984 5.62496L10.7082 0.416626H0.291504Z"
                  fill="#323232"
                />
                <!-- неактив -->
              </svg>

              <svg
                v-if="ask.status"
                width="11"
                height="6"
                viewBox="0 0 11 6"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M0.291504 5.58325L5.49984 0.374918L10.7082 5.58325H0.291504Z"
                  fill="white"
                />
                <!-- активный -->
              </svg>
            </span>
            <p v-if="ask.status" v-html="ask.answer">
              {{ ask.answer }}
            </p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Faq-Page",
  data() {
    return {
      faq: {
        nav: [
          {
            title: "О компании",
            active: false,
            data: [
              {
                ask: "Где находится ваша компания?",
                status: false,
                answer:
                  "Наше производство и все рабочие бригады находятся в городе Устюжна (Вологодская область). В Москве и Санкт-Петербурге находятся наши представительства, в которых Вы можете заключить договор и уточнить все интересующие Вас нюансы.",
              },
              {
                ask: "Из какого материала строите?",
                status: false,
                answer:
                  "Основной материал, из которого мы производим строительство - профилированный брус атмосферной сушки. Также мы осуществляем строительство из профилированного бруса камерной сушки и клееного бруса. Кроме этого мы занимаемся строительством загородных домов по каркасной технологии.",
              },
              {
                ask: "Какой национальности ваши рабочие бригады?",
                status: false,
                answer:
                  "Все наши строительные бригады являются славянской национальности и проживают в Новгородской области. В отличии от большинства наших конкурентов мы не привлекаем к работе иностранных граждан даже в самый пик сезона.",
              },
              {
                ask: "Сколько человек в бригаде?",
                status: false,
                answer:
                  "На несложные и небольшие объекты обычно достаточно 2-х человек. Для возведения больших коттеджей привлекается 3-4 чел в рабочей бригаде.",
              },
            ],
          },
          {
            title: "Этапы работы",
            active: false,
            data: [
              {
                ask: "Как будет происходить работа по моему заказу?",
                status: false,
                answer: `Работа по заказу делится на 8 этапов:
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>Согласование проекта и договора.</li>
                <li>Доставка материала и рабочей бригады, разгрузочные работы.</li>
                <li>Выгрузка материала.</li>
                <li>Подписание договора и оплата материала в размере 70% от договора.</li>
                <li>Производство строительных работ.</li>
                <li>Производство отделочных работ.</li>
                <li>Подписание акта приемки-сдачи объекта.</li>
                <li>Оплата оставшейся суммы в 30% по договору.</li>
                </ol>`,
              },
              {
                ask: "Каким образом производится оплата?",
                status: false,
                answer:
                  "70% оплаты производится на месте строительства, после выгрузки материала и начала строительных работ. Клиенту предоставляется квитанция и подписанный договор с полным перечнем комплектации будущего строения. Оплата производится наличным или безналичным расчетом. Оставшиеся 30% оплачиваются на месте, после завершения всех работ, по факту подписания акта приемки-сдачи объекта.",
              },
              {
                ask: "Требуется ли предоплата?",
                status: false,
                answer:
                  "Предоплата не требуется в случае, если договор подписывается на месте строительства, по факту выгрузки материала. Если клиент желает заключить договор до начала строительства - требуется предоплата в размере 10% от договора. В этом случае по факту выгрузки материала оплата составит 60%, а по завершении строительства - 30%.",
              },
            ],
          },
          {
            title: "О гарантии",
            active: false,
            data: [
              {
                ask: "Предоставляете ли вы гарантию на строительство?",
                status: false,
                answer: `На все строительные работы предоставляется гарантия один год. На фундамент гарантия до семи лет. Согласно договору мы берем на себя обязательства устранить возможные дефекты в двухнедельный срок после обращения.`,
              },
              {
                ask: "На что дается гарантия?",
                status: false,
                answer:
                  "Герметичность кровли, целостность конструкции в целом, целостность отдельных элементов, соблюдение правил ГОСТ.",
              },
              {
                ask: "На что не распространяется гарантия?",
                status: false,
                answer:
                  "На повреждения конструкции в результате неправильной эксплуатации строения. Правила эксплуатации подробно прописаны в договоре.",
              },
            ],
          },
          {
            title: "О фундаменте",
            active: false,
            data: [
              {
                ask: "Входит ли фундамент в базовую комплектацию проекта?",
                status: false,
                answer: `Фундамент не входит в базовую комплектацию. Это сделано потому, что невозможно подобрать стандартный тип фундамента для всех типов почв и проектов.`,
              },
              {
                ask: "Какой фундамент рекомендуете?",
                status: false,
                answer:
                  "Для большинства дачных построек и почв подойдет свайно-винтовой фундамент. Он достаточно долговечен, надежен и экономичен. Однако он не подходит для очень громоздких конструкций и каменистой почвы. Для маленьких строений подойдет опорно-столбчатый фундамент. Для тяжелых зданий стоит рассмотреть ленточный тип основания. Для сложной болотистой почвы подойдет плитный фундамент.",
              },
              {
                ask: "Какие плюсы и минусы свайно-винтового фундамента?",
                status: false,
                answer: `Плюсы:
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>быстрый монтаж</li>
                <li>недорогая цена</li>
                <li>долгий срок службы</li>
                <li>универсальность</li>
                </ol>
                Минусы:
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>не подходит для каменистых почв</li>
                <li>требуется исследование грунта для предотвращения неправильной усадки конструкции</li>
                <li>возможен эффект коррозии свай при недостаточной обработке антикоррозийным составом и при повреждении свай во время закручивания</li>      
                </ol>`,
              },
              {
                ask: "Какие плюсы и минусы опорно-столбчатого фундамента?",
                status: false,
                answer: `Плюсы:
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>быстрый монтаж</li>
                <li>очень низкая цена</li>
                </ol>
                Минусы:
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>подходит только для легких строений</li>
                <li>требуется прочная и устойчивая почва</li>
                <li>возведение невозможно во время осадков</li>      
                </ol>`,
              },
              {
                ask: "Какие плюсы и минусы ленточного фундамента?",
                status: false,
                answer: `Плюсы:
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>надежность</li>
                <li>возможность обустройства цокольного этажа</li>
                <li>равномерное распределение нагрузки</li>
                </ol>
                Минусы:
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>необходимость в привлечении спец-техники</li>
                <li>необходимость дать фундаменту отстояться перед началом строительных работ</li>
                <li>цена выше свайного и блочного фундамента</li>      
                </ol>`,
              },
              {
                ask: "Какие плюсы и минусы плитного фундамента?",
                status: false,
                answer: `Плюсы:
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>самый надежный вид</li>
                <li>подходит для водянистых почв</li>
                <li>равномерное распределение нагрузки</li>
                </ol>
                Минусы:
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>необходимость в привлечении спец-техники</li>
                <li>необходимость дать фундаменту отстояться перед началом строительных работ</li>
                <li>самая высокая цена за счет большого расхода материала и высоких трудозатрат</li>      
                </ol>`,
              },
              {
                ask: "Строите ли вы на уже готовом фундаменте?",
                status: false,
                answer: `Да, мы строим на уже готовом фундаменте заказчика.`,
              },
            ],
          },
          {
            title: "О домах из бруса",
            active: false,
            data: [
              {
                ask: "Какой тип бруса вы используете?",
                status: false,
                answer: `В базовой комплектации на нашем сайте представлены проекты из профилированного бруса атмосферной сушки (естественной влажности) сечением 90х140, 140х140, 190х140 мм. Обращаем ваше внимание на тот факт, что многие компании выкладывают недостоверные параметры сечения материала - 100х150, 150х150, 200х150 соответственно. Такого быть не может, т.к. 10 мм. - стандартная выпилка профиля обрезного материала. Также множество предложений по строительству из якобы "сухого профилированного бруса". Обычно если стоимость строительства из бруса естественной влажности и "сухого" бруса сопоставима - на лицо явный обман.
                Мы можем осуществить строительство из бруса камерной сушки, цена строительства при этом увеличится примерно на 25%.
                Также возможно строительство из клееного бруса, цена рассчитывается индивидуально.`,
              },
              {
                ask: "В чем преимущество бруса перед другими материалами?",
                status: false,
                answer: `Профилированный брус имеет целый ряд преимуществ::
                <ol style="list-style: decimal; padding-left: 5px;">
                <li>поддерживает естественный микроклимат в доме</li>
                <li>обладает отличными теплоизоляционными качествами</li>
                <li>имеет значительное преимущество перед каркасной технологией в сроках эксплуатации</li>
                <li>дешевле абсолютного большинства строительных материалов</li>
                <li>дома из бруса не нуждаются в отделки внешних и внутренних стен</li>
                <li>имеет традиционно привлекательный внешний вид</li>
                </ol>`,
              },
              {
                ask: "Какой тип бруса вы используете?",
                status: false,
                answer: `В базовой комплектации на нашем сайте представлены проекты из профилированного бруса атмосферной сушки (естественной влажности) сечением 90х140, 140х140, 190х140 мм. Обращаем ваше внимание на тот факт, что многие компании выкладывают недостоверные параметры сечения материала - 100х150, 150х150, 200х150 соответственно. Такого быть не может, т.к. 10 мм. - стандартная выпилка профиля обрезного материала. Также множество предложений по строительству из якобы "сухого профилированного бруса". Обычно если стоимость строительства из бруса естественной влажности и "сухого" бруса сопоставима - на лицо явный обман.
        Мы можем осуществить строительство из бруса камерной сушки, цена строительства при этом увеличится примерно на 25%.
        Также возможно строительство из клееного бруса, цена рассчитывается индивидуально.`,
              },
              {
                ask: '"Под ключ" или "под усадку"?',
                status: false,
                answer:
                  'В каждом из методов строительства есть свои плюсы и минусы. В комплектации "под усадку" производится монтаж домокомплекта без внутренней отделки. Сюда включены: сборка наружных и внутренних стен брусового строения, монтаж фронтонов, стропильной системы, кровли, внутренних перегородок первого этажа. Не производится внутренняя отделка, не устанавливается утеплитель, не монтируются окна и двери (вместо них оставляется перевязочный венец для лучшей усадки сруба). Заказывая строительство "под усадку" заказчик обеспечивает себе отсутствие проблем с различными деформациями элементов внутренней отделки на период естественной усадки строения, а также разбивает затраты по строительству на два этапа. Рекомендованный срок усадки здания - от полугода до полутора лет, в зависимости от величины и сложности конструкции. Заказывая строительство "под ключ" заказчик буквально за один месяц может получить готовую загородную недвижимость в полностью пригодно для проживания состоянии со всеми необходимыми элементами внутренней отделки. Однако нужно иметь в виду, что брус - это естественный материал, и подвержен усадке. Средний процент - 5%. Соответственно на этот период (до 1.5 лет) нельзя будет производить отделочных работ и утепления несущих элементов конструкции. Также необходим будет дополнительный уход за дверьми и окнами.',
              },
              {
                ask: "Какую толщину стен выбрать?",
                status: false,
                answer: `В каждом из методов строительства есть свои плюсы и минусы.
        В комплектации "под усадку" производится монтаж домокомплекта без внутренней отделки. Сюда включены: сборка наружных и внутренних стен брусового строения, монтаж фронтонов, стропильной системы, кровли, внутренних перегородок первого этажа. Не производится внутренняя отделка, не устанавливается утеплитель, не монтируются окна и двери (вместо них оставляется перевязочный венец для лучшей усадки сруба). Заказывая строительство "под усадку" заказчик обеспечивает себе отсутствие проблем с различными деформациями элементов внутренней отделки на период естественной усадки строения, а также разбивает затраты по строительству на два этапа. Рекомендованный срок усадки здания - от полугода до полутора лет, в зависимости от величины и сложности конструкции.
        Заказывая строительство "под ключ" заказчик буквально за один месяц может получить готовую загородную недвижимость в полностью пригодно для проживания состоянии со всеми необходимыми элементами внутренней отделки. Однако нужно иметь в виду, что брус - это естественный материал, и подвержен усадке. Средний процент - 5%. Соответственно на этот период (до 1.5 лет) нельзя будет производить отделочных работ и утепления несущих элементов конструкции. Также необходим будет дополнительный уход за дверьми и окнами.`,
              },
              {
                ask: "Сколько ждать усадки сруба?",
                status: false,
                answer: `Активная усадка (70%-80%) происходит первые 2-3 месяца. Далее процесс стремительно замедляется и практически останавливается после полутора лет. В большинстве случаев мы рекомендуем выждать от полугода до года.`,
              },
              {
                ask: "Как ухаживать за постройкой?",
                status: false,
                answer: `Самое главное, что мы рекомендуем сделать - провести антисептирование основания (2-х нижних венцов) и нижних лаг пола. Также в первый месяц окончания строительных работ необходимо будет произвести окрасочные работы наружной поверхности бруса. Мы рекомендуем пользоваться Pinotex или Tikkurila на водной основе.`,
              },
            ],
          },
          {
            title: "О каркасных домах",
            active: false,
            data: [
              {
                ask: "В чем преимущества и недостатки каркасного дома перед брусовым?",
                status: false,
                answer:
                  "Самое главное преимущество - каркасный дом не дает усадки. В таком строении можно безболезненно производить внутреннюю отделку сразу после возведения каркаса стен. Также если сравнивать каркасный дом и брусовой с одинаковой толщиной стен - в каркасном будет несколько теплее. Из минусов можно отметить меньшую долговечность и общую надежность строения, меньшую экологичность и естественность технологии и, соответственно, худший микроклимат в помещении.",
              },
              {
                ask: "Какую толщину стен выбрать?",
                status: false,
                answer:
                  "Для дачного летнего домика достаточно 100 мм. Для комфортного проживания в осенний и весенний период необходимо как минимум 150 мм. Для зимнего строения достаточно 200 мм.",
              },
              {
                ask: "Какой утеплитель выбрать?",
                status: false,
                answer:
                  'Для стен мы рекомендуем выбирать плитный утеплитель Rockwool, т.к. URSA, Isover и аналоги со временем будут оседать, вследствие чего будут образовываться "островки холода". В пол и потолок можно укладывать минеральную вату.',
              },
              {
                ask: "Чем обшить каркасный дом?",
                status: false,
                answer:
                  "Здесь все зависит от вкусовых предпочтений заказчика. В стандартной комплектации предусмотрена вагонка естественной влажности. Также есть возможность выбрать блок-хаус, имитацию бруса или сайдинг.",
              },
            ],
          },
          {
            title: "О барях из бруса",
            active: false,
            data: [
              {
                ask: "Какой материал выбрать для бани?",
                status: false,
                answer:
                  "Профилированный брус атмосферной сушки - идеальный материал для строительства русской бани по соотношению цена/качество. Брус обладает всеми теплоизоляционными свойствами дерева, что очень важно для быстрого прогрева парной, и при этом с брусом значительно меньше хлопот по сравнению бревном. Мы не рекомендуем строить бани каркасного типа в связи с возможным загнивом утеплителя под действием высокой влажности.",
              },
              {
                ask: "Какую толщину стен выбрать?",
                status: false,
                answer:
                  "Все зависит от потребностей. Если планируется сезонное пользование объектом, то достаточно сечения бруса 90х140 мм. Для зимнего использования необходимо 140х140 мм. Если планируется дом-баня для зимнего пользования и проживания - рекомендуется рассмотреть сечение 190х140 мм.",
              },
              {
                ask: "Как устроена парная в ваших банях?",
                status: false,
                answer:
                  "Для обеспечения теплоизоляции парная обтягивается алюминиевой фольгой по всему периметру, сверху обшивается жаропрочной сухой осиновой вагонкой, монтируются двухъярусные пологи из осины.",
              },
              {
                ask: "Какую печь выбрать?",
                status: false,
                answer:
                  "Все зависит от размеров парной. Для парной от 6 до 14 м3 - подойдет печь Ермак-12. Для парной от 6 до 14 м3 - Ермак-16, для парной от 12 до 24 м3 - Ермак-20. Также у всех вышеперечисленных моделей есть модификация ЭЛИТ, которая отличается от базовых вариантов тем, что топка и корпус изготовлены из нержавеющей стали, а не из обычной. Также в моделях ЭЛИТ присутствует окошко на дверце топки из жаропрочного стекла.",
              },
              {
                ask: "Как обработать стены строения?",
                status: false,
                answer:
                  "Самое главное, что мы рекомендуем сделать - провести антисептирование основания (2-х нижних венцов) и нижних лаг пола. Также в первый месяц окончания строительных работ необходимо будет произвести окрасочные работы наружной поверхности бруса. Мы рекомендуем пользоваться Pinotex или Tikkurila на водной основе. Внутри бани нельзя производить лакокрасочных работ, т.к. в результате нагрева краска может выделять вредные для здоровья вещества.",
              },
              {
                ask: "Какой фундамент выбрать для бани?",
                status: false,
                answer:
                  "Как правило, баня - небольшое строение, для которого идеально подходит свайно-винтовой фундамент, а в некоторых случаях можно обойтись даже блочно-столбчатым. Однако каждое строение и тип почвы индивидуальны, поэтому здесь нельзя давать универсальных советов. Обратитесь к нашим специалистам, мы подберем для Вас идеальное решение.",
              },
            ],
          },
        ],
      },
    };
  },
  methods: {
    sendId(item) {
      return item.replaceAll(/\s/g, "");
    },
  },
};
</script>

<style lang="scss" scoped>
.ol-elements {
  list-style: decimal !important;
}

.faq-item-header__item {
  font-weight: 700;
  font-size: 24px;
  line-height: 29px;
  color: #333333;
  margin-bottom: 15px;
}

.faq-header__item {
  font-weight: 700;
  font-size: 24px;
  line-height: 29px;
  /* identical to box height */

  color: #333333;
  margin-bottom: 15px;
}

.faq-item-ask-active {
  background: #2cc37c !important;
  color: white !important;
}

.faq-item-ask {
  background: #f8f8f8;
  border-radius: 10px;
  display: flex;
  align-items: center;
  color: black;
  padding: 20px 15px;
  flex-direction: column;
  margin-bottom: 15px;

  span {
    display: flex;
    align-items: center;
    justify-content: space-between;
    width: 100%;
    padding: 0 15px;

    h4 {
      font-weight: 600;
      font-size: 15px;
      line-height: 17px;
    }
  }

  p {
    margin-top: 15px;
    font-weight: 500;
    font-size: 14px;
    line-height: 17px;
  }
}
</style>
