<template>
  <div id="root">
    <header>
      <div class="global-wrapper">
        <b class="block-title">Как мы работаем</b>
        <work-links @selectItem="scroll" ></work-links>
      </div>
    </header>
    <main>
      <section class="content-section">
         <div class="global-wrapper">
           <div class="how-we-work-card" :class="item.title" v-for="(item, index) in howWeWork" :key="index">
             <img :src="item.img" alt="">
              <div class="text__content">
                <b class="block-title">{{ item.title }}</b>
                <p class="block-subtitle">{{ item.description }}</p>
                <div class="we block">
                  <b>Мы</b>
                  <p v-for="(we, i) in item.we" :key="i"><svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M15.6 8.6857C15.6 7.96284 15.015 7.37142 14.3 7.37142H7.566L8.42401 3.19198L8.45 2.88969C8.45 2.48228 8.281 2.11426 8.02101 1.83828L6.994 0.799988L0.572 7.29254C0.221006 7.64741 0 8.14685 0 8.6857V17.2286C0 18.3194 0.871001 19.2 1.95 19.2H10.725C11.531 19.2 12.22 18.7005 12.519 18.004L15.457 11.0514C15.548 10.828 15.6 10.5783 15.6 10.3286V8.6857Z" fill="#2CC37C"/>
                  </svg>
                  {{ we }} </p>
                </div>
                <div class="other block">
                  <b>Другие</b>
                  <p v-for="(other, i) in item.we" :key="i"><svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M1.30035 12.6286C0.585337 12.6286 0.000342369 12.0372 0.000342369 11.3143V9.67144C0.000342369 9.42173 0.0523481 9.17202 0.143338 8.94858L3.08135 1.99601C3.38035 1.29946 4.06934 0.800013 4.87534 0.800013H13.6503C14.7293 0.800013 15.6003 1.6806 15.6003 2.77144V11.3143C15.6003 11.8531 15.3793 12.3526 15.0283 12.7075L8.60634 19.2L7.57934 18.1617C7.31935 17.8857 7.15035 17.5177 7.15035 17.1103L7.17634 16.808L8.03434 12.6286H1.30035ZM5.30435 3.42859L2.60034 9.82917V10H11.2323L10.4913 13.5749L13.0003 11.0383V3.42859H5.30435Z" fill="#333333" fill-opacity="0.28"/>
                  </svg>
                    {{ other }} </p>
                </div>
              </div>
           </div>
         </div>
      </section>
    </main>
  </div>
</template>

<script>
import WorkLinks from '../components/how-we-work/work-links'
export default {
  name: 'how-we-work',
  data () {
    return {
      options: {
        container: '#root',
        easing: 'ease-in',
        lazy: false,
        offset: -60,
        force: true,
        cancelable: true,
        x: false,
        y: true
      },
      howWeWork: [
        {
          img: 'https://i.imgur.com/uUqsEQ5.png',
          title: 'Проект',
          description: 'Согласование проекта, утверждение договора и стоимости строительства',
          we: ['Предложим на выбор несколько готовых вариантов', 'Бесплатно внесем любые изменения в проект', 'В случае необходимости сделаем расчет в тот же день'],
          other: ['Предложим на выбор несколько готовых вариантов', 'Бесплатно внесем любые изменения в проект', 'В случае необходимости сделаем расчет в тот же день']
        },
        {
          img: 'https://i.imgur.com/Ul7k5cV.png',
          title: 'Материал',
          description: 'Подготовка материала на нашем собственном производстве',
          we: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],
          other: ['Долгая комплектация ща счет закупки материалов у посредника', 'Закупка материалов низкого качества', 'Отсутствие гарантии на материал']
        },
        {
          img: 'https://i.imgur.com/Wc5gVRH.png',
          title: 'Доставка',
          description: 'Подготовка материала на нашем собственном производстве',
          we: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],
          other: ['Долгая комплектация ща счет закупки материалов у посредника', 'Закупка материалов низкого качества', 'Отсутствие гарантии на материал']
        },
        {
          img: 'https://i.imgur.com/T50oV0m.png',
          title: 'Выгрузка',
          description: 'Подготовка материала на нашем собственном производстве',
          we: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],
          other: ['Долгая комплектация ща счет закупки материалов у посредника', 'Закупка материалов низкого качества', 'Отсутствие гарантии на материал']
        },
        {
          img: 'https://i.imgur.com/UD48ZmV.png',
          title: 'Договор',
          description: 'Подготовка материала на нашем собственном производстве',
          we: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],
          other: ['Долгая комплектация ща счет закупки материалов у посредника', 'Закупка материалов низкого качества', 'Отсутствие гарантии на материал']
        },
        {
          img: 'https://i.imgur.com/zMfxJ45.png',
          title: 'Аванс',
          description: 'Подготовка материала на нашем собственном производстве',
          we: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],
          other: ['Долгая комплектация ща счет закупки материалов у посредника', 'Закупка материалов низкого качества', 'Отсутствие гарантии на материал']
        },
        {
          img: 'https://i.imgur.com/QiSDPlT.png',
          title: 'Работа',
          description: 'Подготовка материала на нашем собственном производстве',
          we: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],
          other: ['Долгая комплектация ща счет закупки материалов у посредника', 'Закупка материалов низкого качества', 'Отсутствие гарантии на материал']
        },
        {
          img: 'https://i.imgur.com/u6ycJFu.png',
          title: 'Сруб',
          description: 'Подготовка материала на нашем собственном производстве',
          we: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],
          other: ['Долгая комплектация ща счет закупки материалов у посредника', 'Закупка материалов низкого качества', 'Отсутствие гарантии на материал']
        },
        {
          img: 'https://i.imgur.com/dioRvnj.png',
          title: 'Отделка',
          description: 'Подготовка материала на нашем собственном производстве',
          we: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],
          other: ['Долгая комплектация ща счет закупки материалов у посредника', 'Закупка материалов низкого качества', 'Отсутствие гарантии на материал']
        },
        {
          img: 'https://i.imgur.com/blNlwNj.png',
          title: 'Сдача',
          description: 'Подготовка материала на нашем собственном производстве',
          we: ['Имеем свое производство лесоматериалов', 'Произведем комплектацию объекта в сжатый срок', 'Гарантируем качество нашей продукции'],
          other: ['Долгая комплектация ща счет закупки материалов у посредника', 'Закупка материалов низкого качества', 'Отсутствие гарантии на материал']
        }
      ]
    }
  },
  methods: {
    scroll (e) {
      console.log(e)
      // naхуя нам подтягивать всякие либы, если и без того в ванильном JS есть свои методы
      const element = document.querySelector(`.${e}`)
      element.scrollIntoView({
        behavior: 'smooth',
        block: 'center'
      })
    }
  },
  components: { WorkLinks }
}
</script>

<style lang="scss" scoped>
@import '../static/scss/how-we-work';
</style>
